import numpy as np 

t=str(input("Введите тип линзы "))
F=float(input("Введите фокусное расстояние "))
f=float(input("Введите расстояние от линзы до предмета "))

def pic(t, F, f):
  if t=="Рассеивающая":
    if f!=0:
      print('Изображение будет мнимым, прямым, уменьшенным')
  else:
    if F>=f:
      print('Изображение будет мнимым, прямым, увеличенным')
    elif f>F and f<2*F:
      print('Изображение будет действительным, обратным, увеличенным')
    elif f==2*F:
      print('Изображение будет действительным, обратным, такого же размера')
    else:
      print('Изображение будет действительным, обратным, уменьшенным')

pic(t, F, f)